Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: `?sort=name` (ascending name), `?sort=name,-color` (ascending name and descending color)
ja_jp: `?sort=name` (ascending name), `?sort=name,-color` (昇順の名前と降順の色)

source: `@ApplicationScoped` and `@Singleton` beans are always active scopes and as such are easy to deal with - context propagation tasks can work with those beans so long as the CDI container is running. However, `@RequestScoped` beans are a different story. They are only active for a short period of time which can be bound either to HTTP request or some other request/task when manually activated/deactivated. In this case user must be aware that once the original thread gets to an end of a request, it will terminate the context, calling `@PreDestroy` on those beans and then clearing them from the context. Subsequent attempts to access those beans from other threads can result in unexpected behaviour. It is therefore recommended to make sure all tasks using request scoped beans via context propagation are performed in such a manner that they don't outlive the original request duration.
ja_jp: `@ApplicationScoped` と `@Singleton` のBeanは常にアクティブなスコープであり、そのため対処が簡単です - コンテキスト伝播タスクは、CDI コンテナーが動作している限り、これらのBeanで動作します。しかし、 `@RequestScoped` Beanは話が違います。手動で有効化/無効化すると、HTTP リクエストや他のリクエスト/タスクにバインドされます。この場合、元のスレッドがリクエストの終了に到達すると、コンテキストを終了し、それらのBeanで `@PreDestroy` を呼び出し、コンテキストからクリアされることに注意しなければなりません。その後、他のスレッドからこれらのBeanにアクセスしようとすると、予期せぬ動作をすることがあります。したがって、コンテキストの伝播を介してリクエストスコープされたBeanを使用するすべてのタスクは、元のリクエストの持続時間を超えないような方法で実行されることを確認することが推奨されます。

source: `@ApplicationScoped` and `@Singleton` look very similar. Which one should I choose for my Quarkus application?
ja_jp: `@ApplicationScoped` と `@Singleton` は非常に似ているように見えます。Quarkusアプリケーションにはどれを選べばいいのでしょうか?

source: `@ApplicationScoped` beans can be also destroyed and recreated at runtime. Existing injection points just work because the injected proxy delegates to the current instance.
ja_jp: `@ApplicationScoped` Beanは、実行時に破棄して再作成することもできます。既存のインジェクションポイントは、インジェクションされたプロキシーが現在のインスタンスにデリゲートするので、単に機能します。

source: `@ApplicationScoped` used for lazy initialization
ja_jp: `@ApplicationScoped` 遅延初期化に使用

source: `@ApplicationScoped`, `@Singleton` and `@RequestScoped` outer bean injection scopes are all supported when an `org.eclipse.microprofile.jwt.JsonWebToken` is injected, with the `@RequestScoped` scoping for `JsonWebToken` enforced to ensure the current token is represented.
ja_jp: `org.eclipse.microprofile.jwt.JsonWebToken` が注入される場合、 `@ApplicationScoped`、 `@Singleton`、および `@RequestScoped` の外部 Bean 注入スコープがすべてサポートされます。また、現在のトークンが示されていることを確認するために、 `JsonWebToken` の `@RequestScoped` スコープが適用されます。

source: `@Basic` annotation is used for indexed fields without any special transformation
ja_jp: `@Basic` アノテーションは、インデックス付きフィールドに対して特別な変換を行わずに使用されます。

source: `@BsonId`: allows you to customize the ID field, see <<custom-ids,Custom IDs>>.
ja_jp: `@BsonId`: IDフィールドをカスタマイズすることができます。<<custom-ids,Custom IDs>> を参照してください。

source: `@BsonIgnore`: ignore a field during the serialization.
ja_jp: `@BsonIgnore`: シリアル化の際にフィールドを無視することができます。

source: `@BsonProperty`: customize the serialized name of the field.
ja_jp: `@BsonProperty`: フィールドのシリアル化された名前をカスタマイズします。

source: `@ClientHeaderParam(name = "Content-Type", value = "{calculateContentType}")` which ensures that the `Content-Type` header is created by calling the interface's `calculateContentType` default method.
ja_jp: `@ClientHeaderParam(name = "Content-Type", value = "{calculateContentType}")` は、インターフェイスの `calculateContentType` デフォルトメソッドを呼び出して `Content-Type` ヘッダーが作成されるようにします。

source: `@ClientHeaderParam` can be used on the client interface and on methods. It can specify a constant header value...
ja_jp: `@ClientHeaderParam` は、クライアントインターフェイスとメソッドで使用できます。また、一定のヘッダー値を指定できます...。

source: `@Conditional` is ignored, since dependency injection gets resolved at build time. An alternative is to use xref:cdi-reference.adoc#enable_build_profile[conditional build profiles].
ja_jp: `@Conditional` は無視されます。依存性注入はビルド時に解決されるからです。代替案としては、 xref:cdi-reference.adoc#enable_build_profile[条件付きビルドプロファイル] を使用する方法があります。

source: `@ConfigDocEnumValue` gives a way to explicitly customize the string displayed in the documentation when listing accepted values for an enum.
ja_jp: `@ConfigDocEnumValue` を使用すると、列挙型の許容値をリストするときにドキュメントに表示される文字列を明示的にカスタマイズできます。

source: `@ConfigMapping` is now also supported with some basic validation as well as completions for the application properties.
ja_jp: `@ConfigMapping` は、アプリケーションのプロパティを補完するだけでなく、いくつかの基本的な検証もサポートされるようになりました。

source: `@Consumes` defines the expected content-type consumed by this request (parameters)
ja_jp: `@Consumes` は、このリクエストで消費されると予想されるコンテンツタイプを定義します（パラメータ）。

source: `@Context` elements are not injected via CDI and, as such, may not be injected via constructor injection. Inject `@Context` elements in fields of your resources instead.
ja_jp: `@Context` 要素は CDI によっては注入されないため、コンストラクター注入によって注入することはできません。 代わりに、リソースのフィールドに `@Context` 要素を注入します。

source: `@ConversationScoped` is not supported
ja_jp: `@ConversationScoped` はサポートされていません。

source: `@DaoFactory` method names are irrelevant.
ja_jp: `@DaoFactory` メソッド名は関係ありません。

source: `@DaoFactory` methods should return beans of the following types:
ja_jp: `@DaoFactory` メソッドは、以下の型のBeanを返す必要があります:

source: `@Decorator` marks a decorator component.
ja_jp: `@Decorator` はデコレーターコンポーネントをマークします。

source: `@DefaultBean` allows extensions (or any other code for that matter) to provide defaults while backing off if beans of that type are supplied in any way Quarkus supports.
ja_jp: `@DefaultBean` では、エクステンション (またはそのための他のコード) が Quarkus がサポートする何らかの方法でその型の Bean が提供されている場合、バックオフ中にデフォルトを提供することができます。

source: `@Dependent` beans are destroyed immediately afterwards to follow the behavior of observers declared on `@Dependent` beans.
ja_jp: `@Dependent` Beanは、 `@Dependent` Beanに宣言されたオブザーバーの行動に従うために、その後すぐに破壊されます。

source: `@FormParam` is a standard JAX-RS annotation used to define a form parameter contained within a request entity body
ja_jp: `@FormParam` は、リクエストエンティティボディに含まれるフォームパラメータを定義するために使用される、標準的なJAX-RSアノテーションです。

source: `@FormParam` is a standard Jakarta REST annotation used to define a form parameter contained within a request entity body
ja_jp: `@FormParam` は、リクエストエンティティ本体に含まれるフォームパラメータを定義するために使用される Jakarta REST の標準アノテーションです。

source: `@GraphQLApi` annotation indicates that the CDI bean will be a GraphQL endpoint
ja_jp: `@GraphQLApi` アノテーションは、CDI BeanがGraphQLのエンドポイントになることを示しています。

source: `@IfBuildProfile` and `@UnlessBuildProfile` may be put on a stereotype. A bean will only be enabled if **all** the conditions defined by these annotations are satisfied.
ja_jp: `@IfBuildProfile` と `@UnlessBuildProfile` はステレオタイプに配置できます。Bean は、これらのアノテーションで定義された条件の **すべて** が満たされた場合にのみ有効になります。

source: `@IfBuildProperty` and `@UnlessBuildProperty` are repeatable annotations and may be put on a stereotype. A bean will only be enabled if **all** the conditions defined by these annotations are satisfied.
ja_jp: `@IfBuildProperty` と `@UnlessBuildProperty` は繰り返し可能なアノテーションであり、ステレオタイプに配置できます。Bean は、これらのアノテーションで定義された条件の **すべて** が満たされた場合にのみ取得されます。

source: `@IfBuildProperty` and `@UnlessBuildProperty` are repeatable annotations, i.e. a bean will only be enabled if **all** of the conditions defined by these annotations are satisfied.
ja_jp: `@IfBuildProperty` と `@UnlessBuildProperty` は繰り返し可能なアノテーションです。つまり、これらのアノテーションで定義された条件の **すべて** が満たされた場合にのみBeanが有効になります。

source: `@IfBuildProperty` and `@UnlessBuildProperty` are repeatable annotations, i.e. a bean will only be enabled if **all** the conditions defined by these annotations are satisfied.
ja_jp: `@IfBuildProperty` と `@UnlessBuildProperty` は繰り返し可能なアノテーションです。つまり、これらのアノテーションで定義された条件の **すべて** が満たされた場合にのみBeanが有効になります。

source: `@Incoming` and `@Outgoing` annotations
ja_jp: `@Incoming` および `@Outgoing` アノテーション

source: `@Incoming` and `@Outgoing` method annotations define _channels_ allowing to consume messages from and produce messages to the message broker:
ja_jp: `@Incoming` および `@Outgoing` メソッドアノテーションは、メッセージブローカーからのメッセージの消費とメッセージブローカーへのメッセージの生成を可能にする _チャネル_ を定義します。

source: `@Incoming` can be used by itself to consume messages:
ja_jp: `@Incoming` は、メッセージを消費するために単独で使用できます。

source: `@Indexed` annotation makes the POJO indexable
ja_jp: `@Indexed` アノテーションは、POJOをインデックス可能にします

source: `@Inject Instance<T>` and `@Inject @All List<T>` injection points are handled specifically. The actual type argument is registered as a component. However, if the type argument is an interface the implementations _are not registered_ automatically.
ja_jp: `@Inject Instance<T>` および `@Inject @All List<T>`インジェクションポイントは、特別に処理されます。実際の型引数はコンポーネントとして登録されます。ただし、型引数がインターフェイスの場合、実装は自動的に _登録されません_ 。

source: `@InjectKafkaCompanion` injects the `KafkaCompanion` instance, configured to access the Kafka broker created for tests.
ja_jp: `@InjectKafkaCompanion` は、テスト用に作成された Kafka ブローカーにアクセスするように設定された `KafkaCompanion` インスタンスを注入します。

source: `@InjectMock` is not intended as a universal replacement for functionality provided by the Mockito JUnit extension. It's meant to be used for configuration of unsatisfied dependencies of CDI beans. You can use the `QuarkusComponentTest` and `MockitoExtension` side by side.
ja_jp: `@InjectMock` は、Mockito JUnit エクステンションによって提供される機能すべてに代わるものではありません。 これは、CDI Bean の満たされていない依存関係の設定に使用することを目的としたものです。 `QuarkusComponentTest` は `MockitoExtension` と並行して使用できます。

source: `@InjectMock` results in a Mockito mock being created, which is then available in test methods of the test class (other test classes are *not* affected by this)
ja_jp: `@InjectMock` を使用すると、Mockitoのモックが作成され、テストクラスのテストメソッドで利用できるようになります（他のテストクラスはこの影響を *受けません* ）。

source: `@InjectMock` results in a mock being and is available in test methods of the test class (other test classes are *not* affected by this)
ja_jp: `@InjectMock` により、モックがテストクラスのテストメソッドに存在することになり、利用可能になります (他のテストクラスはこの影響を受け *ません* )。

source: `@Inject` `CriteriaBuilderFactory` or `EntityViewManager` and use it
ja_jp: `@Inject` `CriteriaBuilderFactory` または `EntityViewManager` を使用します

source: `@Inject` is not required if you already annotated your `Logger` with `@LoggerName("...")`.
ja_jp: すでに `Logger` に `@LoggerName("...")` を付与している場合、 `@Inject` は必須ではありません。

source: `@Interceptors` is not supported
ja_jp: `@Interceptors` はサポートされていません。

source: `@JsonRpcDescription` is mandatory for Dev MCP; without it the method is only available in the Dev UI. The method can return primitives, `String`, `JsonObject`, `JsonArray`, or any POJO that can be serialised to JSON. Asynchronous methods (`Uni`, `CompletionStage` or methods annotated with `@NonBlocking`) are also supported.
ja_jp: Dev MCP では `@JsonRpcDescription` が必須です。これがない場合、メソッドは Dev UI でのみ利用可能になります。メソッドはプリミティブ、`String`、`JsonObject`、`JsonArray`、または JSON にシリアライズ可能な任意の POJO を返すことができます。非同期メソッド (`Uni`、`CompletionStage`、または `@NonBlocking` アノテーションが付いたメソッド) もサポートされています。

source: `@JsonView` is also supported for deserializing the request body. So for example in the following code:
ja_jp: `@JsonView` はリクエストボディのデシリアライズにも対応しています。例えば以下のコードでは

source: `@JsonbTypeAdapter` is also supported.
ja_jp: `@JsonbTypeAdapter` もサポートされています。

source: `@Keyword` annotation is used to apply a normalizer to a text field
ja_jp: `@Keyword` アノテーションは、テキストフィールドにnormalizer を適用するために使用します。

source: `@Liveness` - the liveness check accessible at `/q/health/live`
ja_jp: `@Liveness` - `/q/health/live` でアクセス可能なLivenessチェック

source: `@Lock(Lock.Type.READ)` overrides the value specified at class level. It means that any number of clients can invoke the method concurrently, unless the bean instance is locked by `@Lock(Lock.Type.WRITE)`.
ja_jp: `@Lock(Lock.Type.READ)` は、クラスレベルで指定された値を上書きします。これは、Bean のインスタンスが `@Lock(Lock.Type.WRITE)` によってロックされていない限り、任意の数のクライアントが同時にメソッドを呼び出すことができることを意味します。

source: `@Lock` (which maps to `@Lock(Lock.Type.WRITE)`) declared on the class instructs the container to lock the bean instance for any invocation of any business method, i.e. the client has "exclusive access" and no concurrent invocations will be allowed.
ja_jp: クラスで宣言された (`@Lock (Lock.type.Write)` にマッピングされる) `@Lock` は、任意のビジネスメソッドの呼び出しに対して Bean インスタンスをロックするようにコンテナーに指示します。つまり、クライアントには「排他アクセス」があり、同時呼び出しは許可されません。

source: `@LookupIfProperty` and `@LookupUnlessProperty` are repeatable annotations and may be put on a stereotype. A bean will only be obtained if **all** the conditions defined by these annotations are satisfied.
ja_jp: `@LookupIfProperty` と `@LookupUnlessProperty` は繰り返し可能なアノテーションであり、ステレオタイプに配置できます。Bean は、これらのアノテーションで定義された条件の **すべて** が満たされた場合にのみ取得されます。

source: `@MockPanacheEntities` installs mocks for the given entity classes.
ja_jp: `@MockPanacheEntities` は、指定されたエンティティクラスのモックをインストールします。

source: `@MultipartForm` defines the parameter as a value object for incoming/outgoing request/responses of the multipart/form-data mime type.
ja_jp: `@MultipartForm` は、multipart/form-dataマイムタイプの受信/送信リクエスト/レスポンスの値オブジェクトとして、パラメータを定義しています。

source: `@Named @Dependent` beans are shared across all expressions in a template for a single rendering operation, and destroyed after the rendering finished.
ja_jp: `@Named @Dependent` Bean は、1 つのレンダリング操作用にテンプレート内のすべての式で共有され、レンダリングが終了した後に破棄されます。

source: `@NoClassInterceptors`: on the methods
ja_jp: `@NoClassInterceptors`: メソッドについて

source: `@NonBlocking` will force the method to be executed on the event-loop thread.
ja_jp: `@NonBlocking` は、メソッドをイベントループスレッドで強制的に実行します。

source: `@OnClose` methods declared on a server endpoint cannot send items to the connected client by returning objects. They can only send messages to the other clients by using the `WebSocketConnection` object.
ja_jp: サーバーエンドポイントで宣言された `@OnClose` メソッドは、オブジェクトを返すことによって接続されたクライアントに項目を送信できません。 `WebSocketConnection` オブジェクトを使用してのみ、他のクライアントにメッセージを送信できます。

source: `@OnOpen` and `@OnClose` methods support different returned types.
ja_jp: `@OnOpen` メソッドと `@OnClose` メソッドは、異なる戻り値のタイプをサポートします。

source: `@OnOpen` is triggered upon client connection, while `@OnClose` is invoked upon disconnection.
ja_jp: `@OnOpen` はクライアント接続時にトリガーされ、 `@OnClose` は切断時に呼び出されます。

source: `@Outgoing` can be used by itself on a method to generate messages:
ja_jp: `@Outgoing` は、メッセージを生成するメソッドで単独で使用できます。

source: `@PartType` is a RESTEasy specific annotation required when a client performs a multipart request and defines the content type for the part.
ja_jp: `@PartType` は、クライアントがマルチパートのリクエストを実行し、パートのコンテンツタイプを定義する際に必要となる、RESTEasy特有のアノテーションです。

source: `@Path` and `@POST` are the standard JAX-RS annotations used to define how to access the service
ja_jp: `@Path` 、 `@GET` 、 `@PathParam` は、サービスへのアクセス方法を定義するために使用される標準的なJAX-RS アノテーションです。

source: `@Path` and `@POST` are the standard Jakarta REST annotations used to define how to access the service
ja_jp: `@Path` と `@POST` は、サービスへのアクセス方法を定義するために使用される、標準的な Jakarta REST アノテーションです。

source: `@Path`, `@GET` and `@PathParam` are the standard JAX-RS annotations used to define how to access the service
ja_jp: `@Path` 、 `@GET` 、 `@PathParam` は、サービスへのアクセス方法を定義するために使用される標準的な JAX-RS アノテーションです。

source: `@Path`, `@GET` and `@QueryParam` are the standard JAX-RS annotations used to define how to access the service
ja_jp: `@Path` と `@GET` 、 `@QueryParam` はサービスへのアクセス方法を定義するために使用される標準的な JAX-RS アノテーションです。

source: `@Path`, `@GET` and `@QueryParam` are the standard Jakarta REST annotations used to define how to access the service
ja_jp: `@Path` と `@GET` 、 `@QueryParam` は、サービスへのアクセス方法を定義するために使用される標準的な Jakarta REST アノテーションです。

source: `@PermissionsAllowed` can also be used in meta-annotations. For example, a new `@CanWrite` security annotation can be created like this:
ja_jp: `@PermissionsAllowed` はメタアノテーションでも使用できます。 たとえば、新しい `@CanWrite` セキュリティーアノテーションは次のように作成できます。

source: `@PermissionsAllowed` is not repeatable on the class level due to a limitation with Quarkus interceptors. For more information, see the xref:cdi-reference.adoc#repeatable-interceptor-bindings[Repeatable interceptor bindings] section of the Quarkus "CDI reference" guide.
ja_jp: Quarkus インターセプターの制限により、 `@PermissionsAllowed` はクラスレベルで繰り返すことができません。 詳細は、Quarkus CDI リファレンスガイドの xref:cdi-reference.adoc#repeatable-interceptor-bindings[Repeatable interceptor bindings] セクションを参照してください。

source: `@PermitAll` indicates that the given endpoint is accessible by any caller, authenticated or not.
ja_jp: `@PermitAll` は、認証されているかどうかに関わらず、どのような呼出元からでもアクセス可能であることを示しています。

source: `@PostConstruct` and `@PreDestroy` lifecycle callbacks
ja_jp: ライフサイクルコールバック `@PostConstruct` および `@PreDestroy`

source: `@PreDestroy` callback is used to shut down the executor service.
ja_jp: `@PreDestroy` コールバックは、executorサービスをシャットダウンするために使用されます。

source: `@Priority` enables the decorator. Decorators with smaller priority values are called first.
ja_jp: `@Priority` はデコレーターを有効にします。優先度の値が小さいインターセプターが最初に呼び出されます。

source: `@Produces` defines the expected content-type produced by this request (return type)
ja_jp: `@Produces` は、このリクエストによって生成されると予想されるコンテンツタイプを定義します（リターンタイプ）。

source: `@ProtoField` annotation to add the message field as string in the generated Protobuf schema
ja_jp: `@ProtoField` アノテーションは生成されたProtobufスキーマにmessageフィールドを文字列として追加します。

source: `@ProtoField` annotation to add the name field as string in the generated Protobuf schema
ja_jp: `@ProtoField` アノテーションは、生成されたProtobufスキーマにnameフィールドを文字列として追加します。

source: `@QuarkusIntegrationTest` is the natural evolution of `@NativeImageTest` (which is still supported) and can be used to launch and test the artifact produced by the Quarkus build, and supports testing a jar (of all types), a native binary or container-image. For more information see link:https://quarkus.io/guides/getting-started-testing#quarkus-integration-test[this] part of the documentation and the Javadoc of the annotation itself.
ja_jp: `@QuarkusIntegrationTest` は、 `@NativeImageTest` （現在もサポートされています）を自然に進化させたもので、Quarkusのビルドによって生成されたアーティファクトを起動してテストするために使用することができ、（あらゆるタイプの）jar、ネイティブバイナリ、コンテナイメージのテストをサポートしています。詳細については、ドキュメントの link:https://quarkus.io/guides/getting-started-testing#quarkus-integration-test[この]部分と、アノテーション自体のJavadocを参照してください。

source: `@QuarkusIntegrationTest` should be used to launch and test the artifact produced by the Quarkus build, and supports testing a jar (of whichever type), a native image or container image. Put simply, this means that if the result of a Quarkus build (`mvn package` or `gradle build`) is a jar, that jar will be launched as `java -jar ...` and tests run against it. If instead a native image was built, then the application is launched as `./application ...` and again the tests run against the running application. Finally, if a container image was created during the build (by including the `quarkus-container-image-jib` or `quarkus-container-image-docker` extensions and having the `quarkus.container-image.build=true` property configured), then a container is created and run (this requires the `docker` executable being present).
ja_jp: `@QuarkusIntegrationTest` は、Quarkus ビルドによって生成されたアーティファクトを起動およびテストするために使用する必要があり、jar (タイプを問わず)、ネイティブイメージ、またはコンテナーイメージのテストをサポートします。簡単に言えば、Quarkus ビルド (`mvn package` または `gradle build`) の結果が jar である場合、その jar は `java -jar ...` として起動され、それに対してテストが実行されることを意味します。ネイティブイメージがビルドされた場合、アプリケーションは `./application ...` として起動され、実行中のアプリケーションに対してテストが実行されます。最後に、ビルド中に ( `quarkus-container-image-jib` または `quarkus-container-image-docker` エクステンションを含め、 `quarkus.container-image.build=true` プロパティーを設定することで) コンテナーイメージが作成された場合)、コンテナーが作成されて実行されます (これには、 `docker` 実行可能ファイルが存在する必要があります)。

source: `@QuarkusIntegrationTest` should be used to launch and test the artifact produced by the Quarkus build, and supports testing a jar (of whichever type), a native image or container image. Put simply, this means that if the result of a Quarkus build (`mvn package` or `gradle build`) is a jar, that jar will be launched as `java -jar ...` and tests run against it. If instead a native image was built, then the application is launched as `./application ...` and again the tests run against the running application. Finally, if a container image was created during the build (by including the `quarkus-container-image-jib`, `quarkus-container-image-docker`, or `container-image-podman` extensions and having the `quarkus.container-image.build=true` property configured), then a container is created and run (this requires the `docker` or `podman` executable being present).
ja_jp: `@QuarkusIntegrationTest` は、Quarkus ビルドによって生成されたアーティファクトを起動およびテストするために使用する必要があり、jar (タイプを問わず)、ネイティブイメージ、またはコンテナーイメージのテストをサポートします。 簡単に言えば、Quarkus ビルド (`mvn package` または `gradle build`) の結果が jar である場合、その jar は `java -jar ...` として起動され、それに対して実行がテストされることを意味します。 代わりにネイティブイメージがビルドされた場合、アプリケーションは `./application ...` として起動され、実行中のアプリケーションに対して実行がテストされます。 最後に、ビルド中に (`quarkus-container-image-jib`、 `quarkus-container-image-docker` または `container-image-podman` エクステンションを含め、 `quarkus.container-image.build=true` プロパティーを設定することで) コンテナーイメージが作成された場合、コンテナーが作成されて実行されます (これには、 `docker` または `podman` の実行可能ファイルが存在する必要があります)。

source: `@QuarkusIntegrationTest` supports executing tests against an already running instance of the application. This can be achieved by setting the `quarkus.http.test-host` system property when running the tests.
ja_jp: `@QuarkusIntegrationTest` は、アプリケーションのすでに実行中のインスタンスに対するテストの実行をサポートします。これは、テストの実行時に `quarkus.http.test-host` システムプロパティーを設定することで実現できます。

source: `@QuarkusMainTest` does **not** support the following features:
ja_jp: `@QuarkusMainTest` は次の機能を *サポートしません* :

source: `@QuarkusTestResource` applies to all tests, not just `ExtensionsResourceTest`.
ja_jp: `@QuarkusTestResource` は `ExtensionsResourceTest` だけでなく、すべてのテストに適用されます。

source: `@QuarkusTestResource` applies to all tests, not just `TokenSecuredResourceTest`.
ja_jp: `@QuarkusTestResource` は `TokenSecuredResourceTest` だけでなく、すべてのテストに適用されます。

source: `@QuarkusTest` has support for hang detection to help diagnose any unexpected hangs. If no progress is made for a specified time (i.e. no JUnit callbacks are invoked) then Quarkus will print a stack trace to the console to help diagnose the hang. The default value for this timeout is 10 minutes.
ja_jp: `@QuarkusTest` は、予期しないハングを診断するために使用できるハング検出をサポートしています。指定された時間内に進捗がない場合 (つまり、JUnit コールバックが呼び出されない場合)、Quarkus はスタックトレースをコンソールに出力して、ハングの診断を助けます。このタイムアウトのデフォルト値は 10 分です。

source: `@Query` annotation defines that this method will be queryable with the name `allFilms`
ja_jp: `@Query` アノテーションは、このメソッドが `allFilms` という名前でクエリー可能であることを定義します。

source: `@Readiness` - the readiness check accessible at `/q/health/ready`
ja_jp: `@Readiness` - `/q/health/ready` でアクセス可能なReadinessチェック

source: `@RegisterClientInterceptor` Example
ja_jp: `@RegisterClientInterceptor` の例

source: `@RegisterRestClient` allows Quarkus to know that this interface is meant to be available for CDI injection as a REST Client
ja_jp: `@RegisterRestClient` により、Quarkusは、このインターフェイスがRESTクライアントとしてCDIインジェクションに利用可能であることを知ることができます。

source: `@RequestScoped` Endpoint
ja_jp: `@RequestScoped` エンドポイント
